/**
  ******************************************************************************
  * @file     （程序名）	  	systick.h
  * @author （程序作者）		Lu
  * @version（程序版本）		V1.0
  * @date   （修改日期）		2023-11-23
  * @brief  （功能简介）		STM32F103VET6固件库模板
  * @parameter  （参数）		无
  * @return   （返回值）		无
  ******************************************************************************
  * @attention （注意事项）
  * 芯片型号：STM32F103VET6
  * 使用引脚：
  * 修改日期：
  * 实现功能：
  *	
  ******************************************************************************
  */
/*------------------------------------------------------------------------------*/

#ifndef __SYSTICK_H
#define __SYSTICK_H
/* 用户头文件 ------------------------------------------------------------------*/
//#include "stm32f10x.h"   //引用stm32头文件
#include "main.h"

/* 宏定义 ----------------------------------------------------------------------*/


/* 函数声明 --------------------------------------------------------------------*/
void SysTick_Init(void);	//初始化系统滴答定时器 SysTick
void SysTick_Delay_us(__IO u32 nTime);	//延时 us

#define	SysTick_Delay_ms(t)		SysTick_Delay_us(1000*t)  //延时ms

#endif  /*  __SYSTICK_H */

/* END OF FILE ------------------------------------------------------------------*/
