/**
  ******************************************************************************
  * @file     （程序名）	  	chip.h
  * @author （程序作者）		Lu
  * @version（程序版本）		V1.0
  * @date   （修改日期）		2023-12-28
  * @brief  （功能简介）		STM32F103VET6固件库模板
  * @parameter  （参数）		无
  * @return   （返回值）		无
  ******************************************************************************
  * @attention （注意事项）
  * 芯片型号：STM32F103VET6
  * 使用引脚：
  * 修改日期：
  * 实现功能：1.读取芯片唯一ID 2.读取芯片温度
  *	
  ******************************************************************************
  */
/*------------------------------------------------------------------------------*/

#ifndef __CHIP_H
#define __CHIP_H
/* 用户头文件 ------------------------------------------------------------------*/
#include "stm32f10x.h"   //引用stm32头文件

/* 宏定义 ----------------------------------------------------------------------*/
#define     V25                 0x6EE       //对于12位的ADC，3.3V的ADC值为0xfff,温度为25度时对应的电压值为1.43V即0x6EE
#define     AVG_SLOPE           0x05        //斜率 每摄氏度4.3mV 对应每摄氏度0x05
#define     ADC1_DR_Address     ((u32)ADC1_BASE+0x4c)   //ADC1_BASE地址：0x4000 0000+0x2400 即ADC1的基地址，而他的规则数据寄存器的偏移地址是：0x4c

/* 函数声明 --------------------------------------------------------------------*/
void Get_ChipID(uint32_t *chipid);
void Temp_ADC1_Init(void);
//void Get_ChipFlashSize(uint16_t FlashSize);

#endif  /*  __CHIP_H */

/* END OF FILE ------------------------------------------------------------------*/
